/*
 * @Author: Pure <305737824@qq.com>
 * @CreateTime: 2021-07-19 15:02:01
 * @LastEditors: Pure <305737824@qq.com>
 * @LastEditTime: 2022-05-20 16:49:45
 * @Description:正则表达式
 */
/**
 * 价格 0 - 999999999.999
 */
export const price = /^\d{1,9}(\.\d{1,3})?$/;

/**
 * 数量 1-9999999
 */
export const count = /^[1-9]{1}\d{0,6}$/;
/**
 * IP地址
 */
export const ip = /^((2[0-4]\d|25[0-5]|[01]?\d\d?)\.){3}(2[0-4]\d|25[0-5]|[01]?\d\d?)$/;

/**
 * 手机号
 */
export const phone = /^0?(13[0-9]|14[01456879]|15[0-35-9]|16[2567]|17[0-8]|18[0-9]|19[0-35-9])\d{8}$/;
